## Disfrutad :)

In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
from sklearn.ensemble import RandomForestRegressor as RFR    # el modelo , el alias es cosa mia
from sklearn.model_selection import train_test_split as tts  # el alias es cosa mia

In [3]:
path = '../data/salaries_data.csv'
path2 = '../data/test.csv'
path3 = '../data/sample.csv'
path4 = '../data/dt.csv'

In [4]:
dt1 = pd.read_csv(path)
dt2 = pd.read_csv(path2)
dt3 = pd.read_csv(path3)
dtt = pd.read_csv(path4)

In [5]:
dtt = dtt.drop(columns = ['salary', 'salary_currency'])
dtt.info()
dt1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           245 non-null    object
 1   experience_level    245 non-null    object
 2   employment_type     245 non-null    object
 3   job_title           245 non-null    object
 4   salary_in_usd       245 non-null    int64
 5   employee_residence  245 non-null    object
 6   remote_ratio        245 non-null    int64
 7   company_location    245 non-null    object
 8   company_size        245 non-null    object
dtypes: int64(2), object(7)
memory usage: 17.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           500 non-null    int64
 1   experience_level    500 non-null    object
 2   employment_type     500 non-null    object
 3   job_title           500 non-null    object
 4   salary_in_usd       500 non-null    int64
 5   employee_residence  500 non-null    object
 6   remote_ratio        500 non-null    int64
 7   company_location    500 non-null    object
 8   company_size        500 non-null    object
dtypes: int64(3), object(6)
memory usage: 35.3+ KB

In [6]:
dt4 = pd.concat([dt1, dt2, dtt])
dt4

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250.0,US,100,US,M
1,2022,SE,FT,Data Engineer,135000.0,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000.0,US,100,US,M
3,2021,MI,CT,ML Engineer,270000.0,US,100,US,L
4,2021,MI,FT,Data Engineer,26005.0,RO,0,US,L
...,...,...,...,...,...,...,...,...,...
240,2020,SE,FT,Data Scientist,412000.0,US,100,US,L
241,2021e,MI,FT,Principal Data Scientist,151000.0,US,100,US,L
242,2020,EN,FT,Data Scientist,105000.0,US,100,US,S
243,2020,EN,CT,Business Data Analyst,100000.0,US,100,US,L
244,2021e,SE,FT,Data Science Manager,94917.0,IN,50,IN,L

In [7]:
dt4.info(memory_usage='deep') #hay nulos

<class 'pandas.core.frame.DataFrame'>
Int64Index: 852 entries, 0 to 244
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           852 non-null    object
 1   experience_level    852 non-null    object
 2   employment_type     852 non-null    object
 3   job_title           852 non-null    object
 4   salary_in_usd       745 non-null    float64
 5   employee_residence  852 non-null    object
 6   remote_ratio        852 non-null    int64
 7   company_location    852 non-null    object
 8   company_size        852 non-null    object
dtypes: float64(1), int64(1), object(7)
memory usage: 361.9 KB

In [8]:
dt4 = dt4.dropna()
dt4.info(memory_usage='deep') #no hay nulos

<class 'pandas.core.frame.DataFrame'>
Int64Index: 745 entries, 0 to 244
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           745 non-null    object
 1   experience_level    745 non-null    object
 2   employment_type     745 non-null    object
 3   job_title           745 non-null    object
 4   salary_in_usd       745 non-null    float64
 5   employee_residence  745 non-null    object
 6   remote_ratio        745 non-null    int64
 7   company_location    745 non-null    object
 8   company_size        745 non-null    object
dtypes: float64(1), int64(1), object(7)
memory usage: 317.2 KB

In [9]:
for i in dt4.job_title:
    if 'Engineer' in i:
        dt4.job_title.replace({i: 'Data Engineer'}, inplace = True)
    elif 'Analy' in i:
        dt4.job_title.replace({i: 'Data Analyst'}, inplace = True)
    elif 'Architect' in i:
        dt4.job_title.replace({i: 'Data Architect'}, inplace = True)
    elif 'Scien' in i:
        dt4.job_title.replace({i: 'Data Scientist'}, inplace = True)

In [10]:
dt4.job_title.value_counts()

Data Scientist                   296
Data Engineer                    278
Data Analyst                     144
Data Architect                    11
Head of Data                       6
Machine Learning Developer         2
3D Computer Vision Researcher      2
Data Specialist                    2
ETL Developer                      2
Machine Learning Manager           1
Head of Machine Learning           1
Name: job_title, dtype: int64

In [11]:
dt4.work_year.value_counts()

2022     263
2021     181
2021e    179
2020      66
2020      56
Name: work_year, dtype: int64

In [12]:
dt4.work_year.value_counts()
lst = []
for i in dt4.work_year:
    if i == '2021e':
        i=2021
        lst.append(i)
        
    elif '2020' in str(i):
        i=2020
        lst.append(i)

    elif '2021' in str(i):
        i=2021
        lst.append(i)
        
    elif '2022' in str(i):
        i=2022
        lst.append(i)

In [13]:
dt4.work_year=lst

In [14]:
#dt4 = dt4.drop(columns = ['sa'])

In [15]:
dt4=pd.get_dummies(dt4, columns = ['job_title','company_size','employment_type','experience_level','employee_residence','company_location'], drop_first=True)   # drop_first=True, por defecto es False

In [16]:
dt_train = dt4[0:500]
dt_test = dt4[500:607]
dttt=dt4[609:]
#dt_train = pd.concat([dt_train, dttt])

In [17]:
dt_train = dt4[0:500]

dt_train.drop(dt_train.salary_in_usd[dt_train.salary_in_usd > 300000].index, axis = 0)

from sklearn.model_selection import train_test_split as tts

y = dt_train.salary_in_usd

X = dt_train.drop(['salary_in_usd'], axis=1)

X_train, X_test, y_train, y_test = tts(X, y, train_size=0.80, test_size=0.20, random_state=22)

In [18]:
from sklearn.linear_model import LinearRegression as LinReg
lr = LinReg()

from sklearn.linear_model import LogisticRegressionCV as LogReg
lo = LogReg()
from sklearn.ensemble import RandomForestRegressor as RFR
from sklearn.linear_model import BayesianRidge as BR
from sklearn.ensemble import GradientBoostingRegressor as Gr
from mlxtend.regressor import StackingRegressor

'''from lightgbm import LGBMRegressor as LGBMR
lgbmr=LGBMR()
from catboost import CatBoostClassifier as CTC
ctc=CTC(verbose=0)
from catboost import CatBoostRegressor as CTR
ctr=CTR(verbose=0)
from xgboost import XGBClassifier as XGBC
xgbc=XGBC()
from xgboost import XGBRegressor as XGBR
xgbr=XGBR()
from sklearn.ensemble import GradientBoostingRegressor as GBR
gbr=GBR(n_estimators=50, learning_rate=0.2)'''



"""metamodelo=StackingRegressor(regressors=[lr, lo], meta_regressor=lr)
metamodelo.fit(X_train, y_train)"""
linreg = LinReg()
lr = LinReg()
lr.fit(X_train, y_train)
y_pred = lr.predict(X_test)

"""metamodelo.fit(X_train, y_train)
y_pred=metamodelo.predict(X_test)"""

'metamodelo.fit(X_train, y_train)\ny_pred=metamodelo.predict(X_test)'

In [19]:
from sklearn.metrics import mean_squared_error as mse
from sklearn.metrics import r2_score as r2

mse(y_test, y_pred, squared=False), r2(y_test, y_pred)

(36487.853940119385, 0.5818143783643992)

In [20]:
lr.score(X_train, y_train), lr.score(X_test, y_test)

(0.5584768085336373, 0.5818143783643992)

In [21]:
dt_test= dt_test.drop(columns=['salary_in_usd'])

In [22]:
y_pred2 = lr.predict(dt_test)

In [23]:
dt_test['salary_in_usd'] = list(y_pred2)

In [24]:
cols = list(dt_test.columns)

['work_year',
 'remote_ratio',
 'job_title_Data Analyst',
 'job_title_Data Architect',
 'job_title_Data Engineer',
 'job_title_Data Scientist',
 'job_title_Data Specialist',
 'job_title_ETL Developer',
 'job_title_Head of Data',
 'job_title_Head of Machine Learning',
 'job_title_Machine Learning Developer',
 'job_title_Machine Learning Manager',
 'company_size_M',
 'company_size_S',
 'employment_type_FL',
 'employment_type_FT',
 'employment_type_PT',
 'experience_level_EX',
 'experience_level_MI',
 'experience_level_SE',
 'employee_residence_AT',
 'employee_residence_AU',
 'employee_residence_BE',
 'employee_residence_BG',
 'employee_residence_BO',
 'employee_residence_BR',
 'employee_residence_CA',
 'employee_residence_CH',
 'employee_residence_CL',
 'employee_residence_CN',
 'employee_residence_CO',
 'employee_residence_CZ',
 'employee_residence_DE',
 'employee_residence_DK',
 'employee_residence_DZ',
 'employee_residence_EE',
 'employee_residence_ES',
 'employee_residence_FR',
 'employee_residence_GB',
 'employee_residence_GR',
 'employee_residence_HK',
 'employee_residence_HN',
 'employee_residence_HR',
 'employee_residence_HU',
 'employee_residence_IE',
 'employee_residence_IN',
 'employee_residence_IR',
 'employee_residence_IT',
 'employee_residence_JE',
 'employee_residence_JP',
 'employee_residence_KE',
 'employee_residence_LU',
 'employee_residence_MD',
 'employee_residence_MT',
 'employee_residence_MX',
 'employee_residence_MY',
 'employee_residence_NG',
 'employee_residence_NL',
 'employee_residence_NZ',
 'employee_residence_PH',
 'employee_residence_PK',
 'employee_residence_PL',
 'employee_residence_PR',
 'employee_residence_PT',
 'employee_residence_RO',
 'employee_residence_RS',
 'employee_residence_RU',
 'employee_residence_SG',
 'employee_residence_SI',
 'employee_residence_TR',
 'employee_residence_UA',
 'employee_residence_US',
 'employee_residence_VN',
 'company_location_AS',
 'company_location_AT',
 'company_location_AU',
 'company_location_BE',
 'company_location_BR',
 'company_location_CA',
 'company_location_CH',
 'company_location_CL',
 'company_location_CN',
 'company_location_CO',
 'company_location_CZ',
 'company_location_DE',
 'company_location_DK',
 'company_location_DZ',
 'company_location_EE',
 'company_location_ES',
 'company_location_FR',
 'company_location_GB',
 'company_location_GR',
 'company_location_HN',
 'company_location_HR',
 'company_location_HU',
 'company_location_IE',
 'company_location_IL',
 'company_location_IN',
 'company_location_IR',
 'company_location_IT',
 'company_location_JP',
 'company_location_KE',
 'company_location_LU',
 'company_location_MD',
 'company_location_MT',
 'company_location_MX',
 'company_location_NG',
 'company_location_NL',
 'company_location_NZ',
 'company_location_PK',
 'company_location_PL',
 'company_location_PT',
 'company_location_RO',
 'company_location_RU',
 'company_location_SG',
 'company_location_SI',
 'company_location_TR',
 'company_location_UA',
 'company_location_US',
 'company_location_VN',
 'salary_in_usd']

In [25]:
dt_tes3 = dt_test.drop(columns=cols[:-1])

In [26]:
dt_tes3 = dt_tes3.reset_index().rename(columns = {'index':'id'})

In [27]:
dt_tes3.to_csv('sample6.csv', index = False)

In [28]:
tes = pd.read_csv('sample6.csv')

In [29]:
tes

      id  salary_in_usd
0      0   81231.387031
1      1  126304.355066
2      2  141612.093783
3      3  148540.365118
4      4  105910.608290
..   ...            ...
102  102  103594.243839
103  103  136072.176779
104  104  172407.298531
105  105   42377.706564
106  106  100000.000000

[107 rows x 2 columns]